name: DeviceLogonEvents
description: Login and other authentication events
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceLogonEvents
event_version: '0'
event_fields:
- standard_name: EventDateCreation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: DeviceId
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: ComputerName
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: ActionType
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: AccountDomain
  type: string
  description: Domain of the account
  sample_value: ''
- standard_name: UserName
  standard_type: TBD
  name: AccountName
  type: string
  description: User name of the account
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: AccountSid
  type: string
  description: Security Identifier (SID) of the account
  sample_value: ''
- standard_name: LogonType
  standard_type: TBD
  name: LogonType
  type: string
  description: Type of logon session
  sample_value: ''
- standard_name: LogonId
  standard_type: TBD
  name: LogonId
  type: string
  description: Identifier for a logon session. This identifier is unique on the same machine only between restarts.
  sample_value: ''
- standard_name: DstHostName
  standard_type: TBD
  name: RemoteDeviceName
  type: string
  description: Name of the machine that performed a remote operation on the affected machine. Depending on the event being reported, this name could be a fully-qualified domain name (FQDN), a NetBIOS name, or a host name without domain information.
  sample_value: ''
- standard_name: DstIpAddr
  standard_type: TBD
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: RemoteIpType
  standard_type: TBD
  name: RemoteIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback, Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: DstPort
  standard_type: TBD
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: AdditionalFields
  standard_type: TBD
  name: AdditionalFields
  type: string
  description: Additional information about the event in JSON array format
  sample_value: ''
- standard_name: ProcessUserDomain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: ProcessUserName
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: ProcessUserSid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: ProcessIntegrityLevel
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns integrity levels to processes based on certain characteristics, such as if they were launched from an internet download. These integrity levels influence permissions to resources.
  sample_value: ''
- standard_name: ProcessTokenElevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: ProcessHashSha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessHashMd5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessName
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: ProcessId
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: ProcessCommandLine
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: ProcessCreationTime
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: ProcessPath
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessParentId
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentName
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentCreationTime
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: ReportId
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events, this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: AppGuardContainerId
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
- standard_name: UserLocalAdmin
  standard_type: TBD
  name: IsLocalAdmin
  type: boolean
  description: Boolean indicator of whether the user is a local administrator on the device
  sample_value: ''
references: []
tags: []
