name: DeviceEvents
description: Multiple event types, such as process injection, creation of scheduled tasks, and LSASS access attempts
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceEvents
event_version: '0'
event_fields:
- standard_name: EventDateCreation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: DeviceId
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: ComputerName
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: ActionType
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: FileName
  standard_type: TBD
  name: FileName
  type: string
  description: Name of the file that the recorded action was applied to
  sample_value: ''
- standard_name: FolderPath
  standard_type: TBD
  name: FolderPath
  type: string
  description: Folder containing the file that the recorded action was applied to
  sample_value: ''
- standard_name: HashSha1
  standard_type: TBD
  name: SHA1
  type: string
  description: SHA-1 of the file that the recorded action was applied to
  sample_value: ''
- standard_name: HashMd5
  standard_type: TBD
  name: MD5
  type: string
  description: MD5 hash of the file that the recorded action was applied to
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: AccountDomain
  type: string
  description: Domain of the account
  sample_value: ''
- standard_name: UserName
  standard_type: TBD
  name: AccountName
  type: string
  description: User name of the account
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: AccountSid
  type: string
  description: Security Identifier (SID) of the account
  sample_value: ''
- standard_name: RemoteUrl
  standard_type: TBD
  name: RemoteUrl
  type: string
  description: URL or fully qualified domain name (FQDN) that was being connected to
  sample_value: ''
- standard_name: RemoteComputerName
  standard_type: TBD
  name: RemoteDeviceName
  type: string
  description: Name of the machine that performed a remote operation on the affected machine. Depending on the event being reported, this name could be a fully-qualified domain name (FQDN), a NetBIOS name, or a host name without domain information.
  sample_value: ''
- standard_name: ProcessId
  standard_type: TBD
  name: ProcessId
  type: int
  description: Process ID (PID) of the newly created process
  sample_value: ''
- standard_name: ProcessCommandLine
  standard_type: TBD
  name: ProcessCommandLine
  type: string
  description: Command line used to create the new process
  sample_value: ''
- standard_name: ProcessCreationTime
  standard_type: TBD
  name: ProcessCreationTime
  type: date
  description: Date and time the process was created
  sample_value: ''
- standard_name: ProcessTokenElevation
  standard_type: TBD
  name: ProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the newly created process
  sample_value: ''
- standard_name: LogonId
  standard_type: TBD
  name: LogonId
  type: string
  description: Identifier for a logon session. This identifier is unique on the same machine only between restarts.
  sample_value: ''
- standard_name: RegistryKey
  standard_type: TBD
  name: RegistryKey
  type: string
  description: Registry key that the recorded action was applied to
  sample_value: ''
- standard_name: RegistryValueName
  standard_type: TBD
  name: RegistryValueName
  type: string
  description: Name of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: RegistryValueData
  standard_type: TBD
  name: RegistryValueData
  type: string
  description: Data of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: DstIpAddr
  standard_type: TBD
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: DstPort
  standard_type: TBD
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: SrcIpAddr
  standard_type: TBD
  name: LocalIP
  type: string
  description: IP address assigned to the local machine used during communication
  sample_value: ''
- standard_name: SrcPort
  standard_type: TBD
  name: LocalPort
  type: int
  description: TCP port on the local machine used during communication
  sample_value: ''
- standard_name: FileOriginUrl
  standard_type: TBD
  name: FileOriginUrl
  type: string
  description: URL where the file was downloaded from
  sample_value: ''
- standard_name: FileOriginIp
  standard_type: TBD
  name: FileOriginIP
  type: string
  description: IP address where the file was downloaded from
  sample_value: ''
- standard_name: AdditionalFields
  standard_type: TBD
  name: AdditionalFields
  type: string
  description: Additional information about the event in JSON array format
  sample_value: ''
- standard_name: InitiatingProcessSha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessSha256
  standard_type: TBD
  name: InitiatingProcessSHA256
  type: string
  description: SHA-256 of the process (image file) that initiated the event. This field is usually not populated-use the SHA1 column when available.
  sample_value: ''
- standard_name: InitiatingProcessFileName
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessFolderPath
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessId
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessCommandLine
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessCreationTime
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: InitiatingProcessParentId
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: InitiatingProcessParentFileName
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: InitiatingProcessParentCreationTime
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: InitiatingProcessMd5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: InitiatingProcessAccountDomain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: InitiatingProcessAccountName
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: InitiatingProcessAccountSid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: InitiatingProcessLogonId
  standard_type: TBD
  name: InitiatingProcessLogonId
  type: string
  description: Identifier for a logon session of the process that initiated the event. This identifier is unique on the same machine only between restarts.
  sample_value: ''
- standard_name: ReportId
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events, this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: AppGuardContainerId
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
references: []
tags: []
