name: DeviceRegistryEvents
description: Creation and modification of registry entries
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceRegistryEvents
event_version: '0'
event_fields:
- standard_name: EventDateCreation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: DeviceId
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: ComputerName
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: ActionType
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: RegistryKeyPath
  standard_type: TBD
  name: RegistryKey
  type: string
  description: Registry key that the recorded action was applied to
  sample_value: ''
- standard_name: RegistryValueType
  standard_type: TBD
  name: RegistryValueType
  type: string
  description: Data type, such as binary or string, of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: RegistryValueName
  standard_type: TBD
  name: RegistryValueName
  type: string
  description: Name of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: RegistryValueData
  standard_type: TBD
  name: RegistryValueData
  type: string
  description: Data of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: PreviousRegistryValueName
  standard_type: TBD
  name: PreviousRegistryValueName
  type: string
  description: Original name of the registry value before it was modified
  sample_value: ''
- standard_name: PreviousRegistryValueData
  standard_type: TBD
  name: PreviousRegistryValueData
  type: string
  description: Original data of the registry value before it was modified
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserName
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: HashSha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: HashMd5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessName
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: ProcessId
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: ProcessCommandLine
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: ProcessCreationTime
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: ProcessPath
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessParentId
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentName
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentCreationTime
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: ProcessIntegrityLevel
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns integrity levels to processes based on certain characteristics, such as if they were launched from an internet download. These integrity levels influence permissions to resources.
  sample_value: ''
- standard_name: ProcessTokenElevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: ReportId
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events, this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: AppGuardContainerId
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
references: []
tags: []
