name: DeviceNetworkEvents
description: Network connection and related events
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceNetworkEvents
event_version: '1'
event_fields:
- standard_name: EventDateCreation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the record was generated
  sample_value: ''
- standard_name: MachineId
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the device in the service
  sample_value: ''
- standard_name: ComputerName
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the device
  sample_value: ''
- standard_name: ActionType
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: DstIpAddr
  standard_type: TBD
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: DstPort
  standard_type: TBD
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: DstHostName
  standard_type: TBD
  name: RemoteUrl
  type: string
  description: URL or fully qualified domain name (FQDN) that was being connected to
  sample_value: ''
- standard_name: SrcIpAddr
  standard_type: TBD
  name: LocalIP
  type: string
  description: IP address assigned to the local machine used during communication
  sample_value: ''
- standard_name: SrcPort
  standard_type: TBD
  name: LocalPort
  type: int
  description: TCP port on the local machine used during communication
  sample_value: ''
- standard_name: NetworkProtocol
  standard_type: TBD
  name: Protocol
  type: string
  description: Protocol used during the communication
  sample_value: ''
- standard_name: SrcIpAddrType
  standard_type: TBD
  name: LocalIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback, Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: DstIpAddrType
  standard_type: TBD
  name: RemoteIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback, Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: HashSha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: HashSha256
  standard_type: TBD
  name: InitiatingProcessSHA256
  type: string
  description: SHA-256 hash of the process (image file) that initiated the event. This field is usually not populated - use the SHA1 column when available
  sample_value: ''
- standard_name: HashMd5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessName
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessFileSize
  type: long
  description: Size of the process (image file) that initiated the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoCompanyName
  type: string
  description: Company name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoProductName
  type: string
  description: Product name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoProductVersion
  type: string
  description: Product version from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoInternalFileName
  type: string
  description: Internal file name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoOriginalFileName
  type: string
  description: Original file name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessVersionInfoFileDescription
  type: string
  description: Description from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: ProcessId
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: ProcessCommandLine
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: ProcessCreationTime
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: ProcessPath
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessParentName
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentId
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentCreationTime
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserName
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessAccountUpn
  type: string
  description: User principal name (UPN) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: InitiatingProcessAccountObjectId
  type: string
  description: Azure AD object ID of the user account that ran the process responsible for the event
  sample_value: ''
- standard_name: ProcessIntegrityLevel
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns integrity levels to processes based on certain characteristics, such as if they were launched from an internet download. These integrity levels influence permissions to resources
  sample_value: ''
- standard_name: ProcessTokenElevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: ReportId
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter.To identify unique events, this column must be used in conjunction with the DeviceName and Timestamp columns
  sample_value: ''
- standard_name: AppGuardContainerId
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
- standard_name: TBD
  standard_type: TBD
  name: AdditionalFields
  type: string
  description: Additional information about the entity or event
  sample_value: ''
references:
- https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicenetworkevents-table?view=o365-worldwide
tags: []
