name: DeviceEvents
description: Multiple event types, such as process injection, creation of scheduled tasks, and LSASS access attempts
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceEvents
event_version: '1'
event_fields:
- standard_name: event_date_creation
  name: Timestamp
  type: date
  description: Date and time when the event was generated
  sample_value: ''
- standard_name: device_id
  name: DeviceId
  type: string
  description: Unique identifier for the device in the service
  sample_value: ''
- standard_name: computer_name
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the device
  sample_value: ''
- standard_name: action_type
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: file_name
  name: FileName
  type: string
  description: Name of the file that the recorded action was applied to
  sample_value: ''
- standard_name: folder_path
  name: FolderPath
  type: string
  description: Folder containing the file that the recorded action was applied to
  sample_value: ''
- standard_name: hash_sha1
  name: SHA1
  type: string
  description: SHA-1 hash of the file that the recorded action was applied to
  sample_value: ''
- standard_name: hash_sha256
  name: SHA256
  type: string
  description: SHA-256 of the file that the recorded action was applied to
  sample_value: ''
- standard_name: hash_md5
  name: MD5
  type: string
  description: MD5 hash of the file that the recorded action was applied to
  sample_value: ''
- standard_name: file_size
  name: FileSize
  type: long
  description: Size of the file in bytes
  sample_value: ''
- standard_name: user_domain
  name: AccountDomain
  type: string
  description: Domain of the account
  sample_value: ''
- standard_name: user_name
  name: AccountName
  type: string
  description: User name of the account
  sample_value: ''
- standard_name: user_sid
  name: AccountSid
  type: string
  description: Security Identifier (SID) of the account
  sample_value: ''
- standard_name: remote_url
  name: RemoteUrl
  type: string
  description: URL or fully qualified domain name (FQDN) that was being connected to
  sample_value: ''
- standard_name: remote_computer_name
  name: RemoteDeviceName
  type: string
  description: Name of the device that performed a remote operation on the affected machine. Depending on the event being reported, this name could be a fully-qualified domain name (FQDN), a NetBIOS name, or a host name without domain information.
  sample_value: ''
- standard_name: process_id
  name: ProcessId
  type: int
  description: Process ID (PID) of the newly created process
  sample_value: ''
- standard_name: process_command_line
  name: ProcessCommandLine
  type: string
  description: Command line used to create the new process
  sample_value: ''
- standard_name: process_creation_time
  name: ProcessCreationTime
  type: date
  description: Date and time the process was created
  sample_value: ''
- standard_name: process_token_elevation
  name: ProcessTokenElevation
  type: string
  description: Indicates the type of token elevation applied to the newly created process. Possible values are TokenElevationTypeLimited (restricted), TokenElevationTypeDefault (standard), and TokenElevationTypeFull (elevated)
  sample_value: ''
- standard_name: logon_id
  name: LogonId
  type: string
  description: Identifier for a logon session. This identifier is unique on the same machine only between restarts
  sample_value: ''
- standard_name: registry_key
  name: RegistryKey
  type: string
  description: Registry key that the recorded action was applied to
  sample_value: ''
- standard_name: registry_value_name
  name: RegistryValueName
  type: string
  description: Name of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: registry_value_data
  name: RegistryValueData
  type: string
  description: Data of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: dst_ip_addr
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: dst_port
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: src_ip_addr
  name: LocalIP
  type: string
  description: IP address assigned to the local machine used during communication
  sample_value: ''
- standard_name: src_port
  name: LocalPort
  type: int
  description: TCP port on the local machine used during communication
  sample_value: ''
- standard_name: file_origin_url
  name: FileOriginUrl
  type: string
  description: URL where the file was downloaded from
  sample_value: ''
- standard_name: file_origin_ip
  name: FileOriginIP
  type: string
  description: IP address where the file was downloaded from
  sample_value: ''
- standard_name: process_hash_sha1
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_hash_sha256
  name: InitiatingProcessSHA256
  type: string
  description: SHA-256 hash of the process (image file) that initiated the event. This field is usually not populated - use the SHA1 column when available.
  sample_value: ''
- standard_name: process_hash__md5
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_file_name
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: process_file_size
  name: InitiatingProcessFileSize
  type: string
  description: Size of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_file_directory
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_id
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: process_command_line
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: process_creation_time
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: initiating_process_user_domain
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_user_name
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_user_sid
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_user_upn
  name: InitiatingProcessAccountUpn
  type: string
  description: User principal name (UPN) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_user_object_id
  name: InitiatingProcessAccountObjectId
  type: string
  description: Azure AD object ID of the user account that ran the process responsible for the event
  sample_value: ''
- standard_name: process_file_company
  name: InitiatingProcessVersionInfoCompanyName
  type: string
  description: Company name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: process_file_product
  name: InitiatingProcessVersionInfoProductName
  type: string
  description: Product name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: process_file_version
  name: InitiatingProcessVersionInfoProductVersion
  type: string
  description: Product version from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  name: InitiatingProcessVersionInfoInternalFileName
  type: string
  description: Internal file name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  name: InitiatingProcessVersionInfoOriginalFileName
  type: string
  description: Original file name from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: TBD
  name: InitiatingProcessVersionInfoFileDescription
  type: string
  description: Description from the version information of the process (image file) responsible for the event
  sample_value: ''
- standard_name: initiating_process_parent_id
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_parent_file_name
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: initiating_process_parent_creation_time
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: initiating_process_logon_id
  name: InitiatingProcessLogonId
  type: string
  description: Identifier for a logon session of the process that initiated the event. This identifier is unique on the same machine only between restarts
  sample_value: ''
- standard_name: report_id
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter.To identify unique events, this column must be used in conjunction with the DeviceName and Timestamp columns
  sample_value: ''
- standard_name: app_guard_container_id
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
- standard_name: additional_fields
  name: AdditionalFields
  type: string
  description: Additional information about the entity or event
  sample_value: ''
references:
  - https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-deviceevents-table?view=o365-worldwide
tags: []
