name: DeviceFileEvents
description: File creation, modification, and other file system events
platform: windows
log_source: Microsoft Defender for Endpoint
event_id: DeviceFileEvents
event_version: '0'
event_fields:
- standard_name: EventDateCreation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: MachineId
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: ComputerName
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: ActionType
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: FileName
  standard_type: TBD
  name: FileName
  type: string
  description: Name of the file that the recorded action was applied to
  sample_value: ''
- standard_name: FilePath
  standard_type: TBD
  name: FolderPath
  type: string
  description: Folder containing the file that the recorded action was applied to
  sample_value: ''
- standard_name: HashSha1
  standard_type: TBD
  name: SHA1
  type: string
  description: SHA-1 of the file that the recorded action was applied to
  sample_value: ''
- standard_name: HashSha256
  standard_type: TBD
  name: SHA256
  type: string
  description: SHA-256 of the file that the recorded action was applied to. This field is usually not populated-use the SHA1 column when available.
  sample_value: ''
- standard_name: HashMd5
  standard_type: TBD
  name: MD5
  type: string
  description: MD5 hash of the file that the recorded action was applied to
  sample_value: ''
- standard_name: FileOriginUrl
  standard_type: TBD
  name: FileOriginUrl
  type: string
  description: URL where the file was downloaded from
  sample_value: ''
- standard_name: FileOriginReferenceUrl
  standard_type: TBD
  name: FileOriginReferenceUrl
  type: string
  description: URL of the web page that links to the downloaded file
  sample_value: ''
- standard_name: FileOriginIp
  standard_type: TBD
  name: FileOriginIP
  type: string
  description: IP address where the file was downloaded from
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserName
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: Md5Hash
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: Sha1Hash
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessPath
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: ProcessName
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: ProcessId
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: ProcessCommandLine
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: ProcessCreationTime
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: ProcessIntegrityLevel
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns integrity levels to processes based on certain characteristics, such as if they were launched from an internet download. These integrity levels influence permissions to resources.
  sample_value: ''
- standard_name: ProcessTokenElevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: ProcessParentId
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentName
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for the event
  sample_value: ''
- standard_name: ProcessParentCreationTime
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event was started
  sample_value: ''
- standard_name: DstPortName
  standard_type: TBD
  name: RequestProtocol
  type: string
  description: 'Network protocol, if applicable, used to initiate the activity: Unknown, Local, SMB, or NFS'
  sample_value: SMB
- standard_name: ShareName
  standard_type: TBD
  name: ShareName
  type: string
  description: Name of shared folder containing the file
  sample_value: ''
- standard_name: ProcessParentCreationTime
  standard_type: TBD
  name: RequestSourceIP
  type: date
  description: IPv4 or IPv6 address of the remote device that initiated the activity
  sample_value: ''
- standard_name: SrcPort
  standard_type: TBD
  name: RequestSourcePort
  type: integer
  description: Source port on the remote device that initiated the activity
  sample_value: '1234'
- standard_name: UserName
  standard_type: TBD
  name: RequestAccountName
  type: string
  description: User name of account used to remotely initiate the activity
  sample_value: ''
- standard_name: UserDomain
  standard_type: TBD
  name: RequestAccountDomain
  type: string
  description: Domain of the account used to remotely initiate the activity
  sample_value: ''
- standard_name: UserSid
  standard_type: TBD
  name: RequestAccountSid
  type: string
  description: Security Identifier (SID) of the account to remotely initiate the activity
  sample_value: ''
- standard_name: ReportId
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events, this column must be used in conjunction with the DeviceName and Timestamp columns
  sample_value: ''
- standard_name: AppGuardContainerId
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard to isolate browser activity
  sample_value: ''
- standard_name: SensitivityLabel
  standard_type: TBD
  name: SensitivityLabel
  type: ''
  description: Label applied to an email, file, or other content to classify it for information protection
  sample_value: ''
- standard_name: SensitivitySublabel
  standard_type: TBD
  name: SensitivitySubLabel
  type: ''
  description: Sublabel applied to an email, file, or other content to classify it for information protection; sensitivity sublabels are grouped under sensitivity labels but are treated independently
  sample_value: ''
- standard_name: IsAzureInfoProtectionApplied
  standard_type: TBD
  name: IsAzureInfoProtectionApplied
  type: ''
  description: Indicates whether the file is encrypted by Azure Information Protection
  sample_value: ''
references: []
tags: []
